---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.ReverseIterator
source: html/84db8221-5692-ff8f-e5b1-e968a389ed0c.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferenceArrayArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.